swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
/**************************************************************************//**
 * @file     rtl8195bhp_flash.c
 * @brief    Implement HAL flash ROM code functions.
 * @version  1.00
 * @date     2017-08-22
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/
#include "cmsis.h"
#include "rtl8735b_spic_type.h"

#define SECTION_FLASH_TEXT           SECTION(".rom.hal_flash.text")
#define SECTION_FLASH_DATA           SECTION(".rom.hal_flash.data")
#define SECTION_FLASH_RODATA         SECTION(".rom.hal_flash.rodata")
#define SECTION_FLASH_BSS            SECTION(".rom.hal_flash.bss")
#define SECTION_FLASH_STUBS          SECTION(".rom.hal_flash.stubs")

extern const u32 spic_calibration_pattern[4];

/**

        \addtogroup hal_flash FLASH
        @{
*/


/**
  \brief The data sturcture includes various dummy cycles corresponding to different flash commands for unknown flash type.
*/
SECTION_FLASH_RODATA
static const flash_dummy_cycle_t default_dc = {
	0x0,// dc_read;
	0x8,// dc_dread;
	0x4,// dc_2read;
	0x8,// dc_qread;
	0x4,// dc_4read, for quad io should enable prm mode;2+4
	0x7,// dc_dtr_4read, for quad io dtr should enable prm mode;1+7
	0x4,// dc_qpi_read, for qpi should enable prm mode;2+4
	0x7,// dc_dtr_qpi_read, for qpi dtr should enable prm mode;1+7
	0x0,// dc_read_status;
	0x0,// dc_dtr_4read_status;
};

/**
  \brief The data sturcture includes various dummy cycles corresponding to different flash commands for Winbond flash.
*/
SECTION_FLASH_RODATA
static const flash_dummy_cycle_t winbond_dc = {
	0x0,// dc_read;
	0x8,// dc_dread;
	0x4,// dc_2read;
	0x8,// dc_qread;
	0x4,// dc_4read, for quad io should enable prm mode;2+4
	0x6,// dc_dtr_4read, for quad io dtr should enable prm mode;1+7
	0x4,// dc_qpi_read, for qpi should enable prm mode;2+4
	0x6,// dc_dtr_qpi_read, for qpi dtr should enable prm mode;1+7
	0x0,// dc_read_status;
	0x0,// dc_dtr_4read_status;
};

/**
  \brief The data sturcture includes various dummy cycles corresponding to different flash commands for ESMT flash.
*/
SECTION_FLASH_RODATA
static const flash_dummy_cycle_t esmt_dc = {
	0x0,// dc_read;
	0x8,// dc_dread;
	0x4,// dc_2read;
	0x8,// dc_qread;
	0x4,// dc_4read, for quad io should enable prm mode;2+4
	0x6,// dc_dtr_4read, for quad io dtr should enable prm mode;1+7
	0x4,// dc_qpi_read, for qpi should enable prm mode;2+4
	0x6,// dc_dtr_qpi_read, for qpi dtr should enable prm mode;1+7
	0x0,// dc_read_status;
	0x0,// dc_dtr_4read_status;
};


/**
  \brief The data sturcture includes various dummy cycles corresponding to different flash commands for MXIC flash.
*/
SECTION_FLASH_RODATA
static const flash_dummy_cycle_t mxic_dc = {
	0x0,// dc_read;
	0x8,// dc_dread;
	0x4,// dc_2read;
	0x8,// dc_qread;
	0x4,// dc_4read, for quad io should enable prm mode;2+4
	0x4,// dc_dtr_4read, for quad io dtr should enable prm mode;1+7
	0x4,// dc_qpi_read, for qpi should enable prm mode;2+4
	0x4,// dc_dtr_qpi_read, for qpi dtr should enable prm mode;1+7
	0x0,// dc_read_status;
	0x0,// dc_dtr_4read_status;
};

/**
  \brief The data sturcture includes various dummy cycles corresponding to different flash commands for Micron flash.
*/
SECTION_FLASH_RODATA
static const flash_dummy_cycle_t micron_dc = {
	0x0,// dc_read;
	0x8,// dc_dread;
	0x8,// dc_2read;
	0x8,// dc_qread;
	0x8,// dc_4read, for quad io should enable prm mode;2+4
	0x6,// dc_dtr_4read, for quad io dtr should enable prm mode;1+7
	0x8,// dc_qpi_read, for qpi should enable prm mode;2+4
	0x6,// dc_dtr_qpi_read, for qpi dtr should enable prm mode;1+7
	0x0,// dc_read_status;
	0x0,// dc_dtr_4read_status;
};

/**
  \brief The data sturcture includes various flash commands for unknown flash type.
*/
SECTION_FLASH_RODATA
static const flash_cmd_t default_cmd = {
	0x06, // wren,
	0x04, // wrdi,
	0x05, // rdsr,
	0x01, // wrsr,
	0x35, // rdsr2,
	0x31, // wrsr2,
	0x15, // rdsr3,
	0x11, // wrsr3,
	0xC8, // rear, Read extended address register
	0xC5, // wear, Write extended address register
	0x20, // se,
	0x52, // be_32k,
	0xD8, // be_64k,
	0xC7, // ce,
	0x9F, // rdid,
	0x03, // read,
	0x0B, // fread,
	0x3B, // dread,
	0xBB, // str_2read,
	0xBD, // dtr_2read,
	0x6B, // qread,
	0xEB, // str_4read,
	0xED, // dtr_4read
	0x02, // pp,
	0xB9, // dp,
	0x00, // udp,
	0xAB, // rdp,
	0xFF, // en_spi,
	0x38, // en_qpi,
	0x36, // block_lock,
	0x39, // block_unlock,
	0x7E, // global_lock,
	0x98, // global_unlock,
	0x3D, // read_block_lock,
	0x66, // en_reset,
	0x99, // reset,
	0x5A // read_sfdp,
};

/**
  \brief The data sturcture includes various flash commands for Winbond flash.
*/
SECTION_FLASH_RODATA
static const flash_cmd_t winbond_cmd = {
	0x06, // wren,
	0x04, // wrdi,
	0x05, // rdsr,
	0x01, // wrsr,
	0x35, // rdsr2,
	0x31, // wrsr2,
	0x15, // rdsr3,
	0x11, // wrsr3,
	0xC8, // rear, Read extended address register
	0xC5, // wear, Write extended address register
	0x20, // se,
	0x52, // be_32k,
	0xD8, // be_64k,
	0xC7, // ce,
	0x9F, // rdid,
	0x03, // read,
	0x0B, // fread,
	0x3B, // dread,
	0xBB, // str_2read,
	0xBD, // dtr_2read,
	0x6B, // qread,
	0xEB, // str_4read,
	0xED, // dtr_4read
	0x02, // pp,
	0xB9, // dp,
	0x00, // udp,
	0xAB, // rdp,
	0xFF, // en_spi,
	0x38, // en_qpi,
	0x36, // block_lock,
	0x39, // block_unlock,
	0x7E, // global_lock,
	0x98, // global_unlock,
	0x3D, // read_block_lock,
	0x66, // en_reset,
	0x99, // reset,
	0x00 // read_sfdp,
};

/**
  \brief The data sturcture includes various flash commands for MXIC flash.
*/
SECTION_FLASH_RODATA
static const flash_cmd_t mxic_cmd = {
	0x06, // wren,
	0x04, // wrdi,
	0x05, // rdsr,
	0x01, // wrsr, should follow by address bytes
	0x15, // rdsr2, read configuration register
	0x00, // wrsr2,
	0x00, // rdsr3,
	0x00, // wrsr3,
	0xC8, // rear, Read extended address register
	0xC5, // wear, Write extended address register
	0x20, // se,
	0x52, // be_32k,
	0xD8, // be_64k,
	0xC7, // ce,
	0x9F, // rdid,
	0x03, // read,
	0x0B, // fread,
	0x3B, // dread,
	0xBB, // str_2read,
	0x00, // dtr_2read,
	0x6B, // qread,
	0xEB, // str_4read,
	0xED, // dtr_4read,
	0x02, // pp,
	0xB9, // dp,
	0x00, // udp,
	0xAB, // rdp,
	0xF5, // en_spi,
	0x35, // en_qpi,
	0x00, // block_lock,
	0x00, // block_unlock,
	0x00, // global_lock,
	0x00, // global_unlock,
	0x00, // read_block_lock,
	0x66, // en_reset,
	0x99, // reset,
	0x5A // read_sfdp,
};

/**
  \brief The data sturcture includes various flash commands for Micron flash.
*/
SECTION_FLASH_RODATA
static const flash_cmd_t micron_cmd = {
	0x06, // wren,
	0x04, // wrdi,
	0x05, // rdsr,
	0x01, // wrsr, should follow by address bytes
	0x70, // rdsr2, read flag status register
	0x00, // wrsr2,
	0x00, // rdsr3,
	0x00, // wrsr3,
	0xC8, // rear, Read extended address register
	0xC5, // wear, Write extended address register
	0x20, // se,
	0x52, // be_32k,
	0xD8, // be_64k,
	0xC7, // ce,
	0x9F, // rdid,
	0x03, // read,
	0x0B, // fread,
	0x3B, // dread,
	0xBB, // str_2read,
	0xBD, // dtr_2read,
	0x6B, // qread,
	0xEB, // str_4read,
	0xED, // dtr_4read,
	0x02, // pp,
	0xB9, // dp,
	0x00, // udp,
	0xAB, // rdp,
	0xF5, // en_spi,
	0x35, // en_qpi,
	0x00, // block_lock,
	0x00, // block_unlock,
	0x00, // global_lock,
	0x00, // global_unlock,
	0x00, // read_block_lock,
	0x66, // en_reset,
	0x99, // reset,
	0x5A // read_sfdp,
};

/**
  \brief The data sturcture includes various flash commands for ESMT flash.
*/
SECTION_FLASH_RODATA
static const flash_cmd_t esmt_cmd = {
	0x06, // wren,
	0x04, // wrdi,
	0x05, // rdsr,
	0x01, // wrsr,
	0x09, // rdsr2,
	0xC0, // (wrsr2)wrsr3,
	0x95, // rdsr3,
	0xC1, // (wrsr3)wrsr4,
	0x85, // (rear, Read extended address register)rdsr4
	0x00, // wear, Write extended address register
	0x20, // se,
	0x52, // be_32k,
	0xD8, // be_64k,
	0xC7, // ce,
	0x9F, // rdid,
	0x03, // read,
	0x0B, // fread,
	0x3B, // dread,
	0xBB, // str_2read,
	0xBD, // dtr_2read,
	0x6B, // qread,
	0xEB, // str_4read,
	0xED, // dtr_4read
	0x02, // pp,
	0xB9, // dp,
	0x00, // udp,
	0xAB, // rdp,
	0xFF, // en_spi,
	0x38, // en_qpi,
	0x00, // block_lock,
	0x00, // block_unlock,
	0x00, // global_lock,
	0x00, // global_unlock,
	0x00, // read_block_lock,
	0x66, // en_reset,
	0x99, // reset,
	0x00 // read_sfdp,
};


/// @cond DOXYGEN_ROM_HAL_API

/**

        \addtogroup hal_flash_rtl_func FLASH HAL ROM APIs
        \ingroup hal_flash
        \brief ROM APIs implement flash commands.
               The user application(in RAM space) should not call these APIs directly.
               There is another set of Flash HAL APIs in the RAM space is provided for the user application.
        @{
*/


/**
  \brief The stubs functions table to exports Flash HAL functions in ROM.
*/
SECTION_FLASH_STUBS const hal_flash_func_stubs_t hal_flash_stubs = {
	.hal_flash_read_unique_id = flash_rtl_read_unique_id,
	.hal_flash_read_id = flash_rtl_read_id,
	.hal_flash_set_write_enable = flash_rtl_set_write_enable,
	.hal_flash_set_status = flash_rtl_set_status,
	.hal_flash_set_status_no_check = flash_rtl_set_status_no_check,
	.hal_flash_set_status_with_addr = flash_rtl_set_status_with_addr,
	.hal_flash_set_extended_addr = flash_rtl_set_extended_addr,
	.hal_flash_set_write_protect_mode = flash_rtl_set_write_protect_mode,
	.hal_flash_get_status = flash_rtl_get_status,
	.hal_flash_get_status_with_addr = flash_rtl_get_status_with_addr,
	.hal_flash_get_extended_addr = flash_rtl_get_extended_addr,
	.hal_flash_wait_ready = flash_rtl_wait_ready,
	.hal_flash_chip_erase = flash_rtl_chip_erase,
	.hal_flash_64k_block_erase = flash_rtl_64k_block_erase,
	.hal_flash_32k_block_erase = flash_rtl_32k_block_erase,
	.hal_flash_sector_erase = flash_rtl_sector_erase,
	.hal_flash_set_dummy_cycle = flash_rtl_set_dummy_cycle,
	.hal_flash_query_sector_protect_state = flash_rtl_query_sector_protect_state,
	.hal_flash_protect_sector = flash_rtl_protect_sector,
	.hal_flash_unprotect_sector = flash_rtl_unprotect_sector,
	.hal_flash_global_lock = flash_rtl_global_lock,
	.hal_flash_global_unlock = flash_rtl_global_unlock,
	.hal_flash_set_quad_enable = flash_rtl_set_quad_enable,
	.hal_flash_unset_quad_enable = flash_rtl_unset_quad_enable,
	.hal_flash_enable_qpi = flash_rtl_enable_qpi,
	.hal_flash_return_spi = flash_rtl_return_spi,
	.hal_flash_return_str = flash_rtl_return_str,
	.hal_flash_enter_power_down = flash_rtl_enter_power_down,
	.hal_flash_release_from_power_down = flash_rtl_release_from_power_down,
	.hal_flash_stream_read = flash_rtl_stream_read,
	.hal_flash_stream_write = flash_rtl_stream_write,
	.hal_flash_burst_read = flash_rtl_burst_read,
	.hal_flash_burst_write = flash_rtl_burst_write,
	.hal_flash_page_program = flash_rtl_page_program,
	.hal_flash_reset_to_spi = flash_rtl_reset_to_spi
};


/** \brief Description of flash_rtl_read_unique_id
 *
 *    flash_rtl_read_unique_id is used to read unique ID for the flash.
 *    This function is only valid for Winbond Flash.
 *    The ID is unique for each flash sample even if the part number is the name.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param uint8_t *buf:      The buff to store ID.
 *   \param uint8_t *len:      The lenght of ID.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_read_unique_id(void *adaptor, uint8_t *buf, uint8_t len)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	u8 i;

	DBG_SPIF_INFO("flash_read_unique_id: (0x%x)\r\n", adaptor);

	/*Load current setting of ctrlr0 register*/
	spic_rtl_disable(spic_dev);

	/*Set chnl num to send read id command*/
	phal_spic_adaptor->spic_send_cmd_mode = SingleChnl;

	/*Expect to receive 8 byte unique ID data*/
	spic_rtl_set_ctrl1(spic_dev, 12);

	spic_rtl_rx_cmd(phal_spic_adaptor, 0x4B, 0, 0);

