swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
	/*Skip 4 dummy bytes*/
	spic_dev->SPIC_DR_WORD;

	for (i = 0; i < len; i++) {
		buf[i] = HAL_READ8(SPIC_BASE, 0x60);
	}
}

/** \brief Description of flash_rtl_read_id
 *
 *    flash_rtl_read_id is used to read ID for the flash.
 *    Flash with the same part number has the same flash ID.
 *    ID can be used to identify the type of flash.
 *    The ID information is stored in the flash adaptor.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return hal_status_t.
 */
SECTION_FLASH_TEXT
hal_status_t flash_rtl_read_id(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	phal_spic_adaptor->spic_dev = SPIC;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	pflash_cmd_t cmd;
	u32 rd_data;
	u32 reg_value;
	u8 flash_id[3];
	u8 retry_count;

	DBG_SPIF_INFO("flash_read_id: (0x%x)\r\n", adaptor);

	/*Load current setting of ctrlr0 register*/
	reg_value = spic_dev->SPIC_CTRLR0;

	cmd = (pflash_cmd_t)&default_cmd;
	phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&default_dc;

	spic_rtl_disable(spic_dev);

	/*Set chnl num to send read id command*/
	phal_spic_adaptor->spic_send_cmd_mode = SingleChnl;
	reg_value &= ~(SPIC_MASK_CMD_CH | SPIC_MASK_DATA_CH | SPIC_MASK_ADDR_CH);
	spic_dev->SPIC_CTRLR0 = reg_value;

	/*Expect to receive 3 byte ID data*/
	spic_rtl_set_ctrl1(spic_dev, 3);

	for (retry_count = 0; retry_count < 3; retry_count++) {

		/*Send Read ID Command to Flash */
		spic_rtl_rx_cmd(phal_spic_adaptor, cmd->rdid, 0, 0);
		//dbg_printf("cmd->rdid = %x\r\n",cmd->rdid);
		rd_data = spic_dev->SPIC_DR_WORD;
		flash_id[0] = rd_data & 0xFF;
		flash_id[1] = (rd_data >> 8) & 0xFF;
		flash_id[2] = (rd_data >> 16) & 0xFF;
		if ((flash_id[0] != 0)
			&& flash_id[0] != 0xFF) {
			switch (flash_id[0]) {
			case 0x20:
				phal_spic_adaptor->flash_type = FLASH_TYPE_MICRON;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&micron_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&micron_dc;
				break;

			case 0xEF:
				phal_spic_adaptor->flash_type = FLASH_TYPE_WINBOND;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&winbond_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&winbond_dc;
				break;

			case 0xC2:
				phal_spic_adaptor->flash_type = FLASH_TYPE_MXIC;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&mxic_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&mxic_dc;
				break;

			case 0x1C:
				phal_spic_adaptor->flash_type = FLASH_TYPE_EON;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&esmt_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&esmt_dc;
				break;

			case 0xC8:
				if (phal_spic_adaptor->flash_id[2] >= 0x16) {
					phal_spic_adaptor->flash_type = FLASH_TYPE_GD32;
				} else {
					phal_spic_adaptor->flash_type = FLASH_TYPE_GD;
				}
				phal_spic_adaptor->cmd = (pflash_cmd_t)&default_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&default_dc;
				break;

			case 0x0B:
				phal_spic_adaptor->flash_type = FLASH_TYPE_XTX;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&default_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&default_dc;
				break;

			case 0x68:
				phal_spic_adaptor->flash_type = FLASH_TYPE_BOYA;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&default_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&default_dc;
				break;

			case 0x46:
				phal_spic_adaptor->flash_type = FLASH_TYPE_XMC;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&default_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&default_dc;
				break;

			case 0x5E:
				phal_spic_adaptor->flash_type = FLASH_TYPE_ZBIT;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&default_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&default_dc;
				break;

			default:
				phal_spic_adaptor->flash_type = FLASH_TYPE_OTHERS;
				phal_spic_adaptor->cmd = (pflash_cmd_t)&default_cmd;
				phal_spic_adaptor->dummy_cycle = (pflash_dummy_cycle_t)&default_dc;
				break;
			}

			phal_spic_adaptor->flash_id[0] = flash_id[0];
			phal_spic_adaptor->flash_id[1] = flash_id[1];
			phal_spic_adaptor->flash_id[2] = flash_id[2];
			break;
		}

		if (retry_count == 2) {
			DBG_SPIF_ERR("Invalid ID\r\n");
			return HAL_ERR_HW;
		}
	}

	DBG_SPIF_INFO("Flash Type = %d\r\n", phal_spic_adaptor->flash_type);
	DBG_SPIF_INFO("Flash ID = %x\r\n", phal_spic_adaptor->flash_id[0]);
	DBG_SPIF_INFO("Flash ID = %x\r\n", phal_spic_adaptor->flash_id[1]);
	DBG_SPIF_INFO("Flash ID = %x\r\n", phal_spic_adaptor->flash_id[2]);

	return HAL_OK;
}

/** \brief Description of flash_rtl_reset_to_spi
 *
 *    flash_rtl_reset_to_spi is used to reset flash back to SPI mode.
 *    This function is called when SPIC cannot read correct ID.
 *    It would be two scenarios that ID cannot be read.
 *    First, flash may enter unknown state that SPIC cannot access the flash with the correct IO mode.
 *    Second, flash may be in deep power down state so that commands sent by SPIC cannot be recognized.
 *    This function aims to wake up flash and reset it to default SPI mode.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_reset_to_spi(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;

	phal_spic_adaptor->spic_dev = SPIC;
	pflash_cmd_t cmd = (pflash_cmd_t)&default_cmd;
	u8 spic_bit_mode = phal_spic_adaptor->spic_bit_mode;

	/*Read ID fails with one IO mode, flash may be in deep power down state*/
	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->rdp, 0, 0);

	phal_spic_adaptor->spic_bit_mode = SpicQpiMode;
	spic_rtl_config_user_mode(phal_spic_adaptor);
	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->rdp, 0, 0);
	hal_delay_us(100);
	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, FLASH_CMD_EN_SPI1, 0, 0);
	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, FLASH_CMD_EN_SPI2, 0, 0);

	phal_spic_adaptor->spic_bit_mode = SpicOneIOMode;
	spic_rtl_config_user_mode(phal_spic_adaptor);

	phal_spic_adaptor->spic_bit_mode = spic_bit_mode;
	DBG_SPIF_WARN("Reset Flash to SPI Mode\r\n");
}

/** \brief Description of flash_rtl_set_write_enable
 *
 *    flash_rtl_set_write_enable is used to send write enable command.
 *    After the command is sent, SPIC checks if the write enable bit is set or not.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_write_enable(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;

