swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
	flash_rtl_wait_ready(phal_spic_adaptor);

	do {
		spic_rtl_tx_cmd(phal_spic_adaptor, cmd->wren, 0, 0);
	} while ((flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr) & 0x2) == 0);
}

/** \brief Description of flash_rtl_set_status
 *
 *    flash_rtl_set_status is used to send write status register command.
 *    Write status register command may not be the same for different status registers or different flash types.
 *    Users can input an instruction and a value according to flash data sheet to set the status register.
 *    The function will check if flash is ready after setting the status register.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u8 cmd:      The instruction of write status register command.
 *   \param u8 data:     The value is going to be set in status register.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_status(void *adaptor, u8 cmd, u8 data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd, 1, &data);
}

/** \brief Description of flash_rtl_set_status_no_check
 *
 *    flash_rtl_set_status_no_check is used to send write status register command.
 *    Write status register command may not be the same for different status registers or different flash types.
 *    Users can input an instruction and a value according to flash data sheet to set the status register.
 *    The function will NOT check if flash is ready after setting the status register.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u8 cmd:      The instruction of write status register command.
 *   \param u8 data:     The value is going to be set in status register.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_status_no_check(void *adaptor, u8 cmd, u8 data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd, 1, &data);
}

/** \brief Description of flash_rtl_set_status_with_addr
 *
 *    flash_rtl_set_status_with_addr is used to send write status register with address command.
 *    Write status register command may not be the same for different status registers or different flash types.
 *    Some write status commands allow to carry one address byte to identify which status register.
 *    Users can input an instruction, an address and a value according to flash data sheet to set the status register.
 *    The function will check if flash is ready after setting the status register.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u8 cmd:      The instruction of write status register command.
 *   \param u8 addr:     The address of write status register command.
 *   \param u8 data:     The value is going to be set in status register.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_status_with_addr(void *adaptor, u8 cmd, u8 addr, u8 data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	u8 buff[2];

	buff[0] = addr;
	buff[1] = data;

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd, 2, buff);
}

/** \brief Description of flash_rtl_set_extended_addr
 *
 *    flash_rtl_set_extended_addr is used to send set extended address command.
 *    Flash access 128 Mbit region at most with three address bytes.
 *    With this command, the value followed by the command presents the fourth address byte.
 *    Flash accesses beyond 128 Mbit region by setting different value of the fourth address byte to switch among different 128 Mbit bank.
 *    Some flashes cannot support this feature, please refer to flash data sheets.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u8 data:     The fourth address byte.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_extended_addr(void *adaptor, u8 data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->wear, 1, &data);
}

/** \brief Description of flash_rtl_set_write_protect_mode
 *
 *    flash_rtl_set_write_protect_mode is used to send set write protect mode command.
 *    Write protect feature can be either by multiple blocks or by individual block.
 *    Only some of Winbond flashes support this feature.
 *    The block protect control byte is written to one of the status register.
 *    Please refer to flash data sheet for more details
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u8 mode:     The block protect control parameter.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_write_protect_mode(void *adaptor, u8 mode)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 value = 0;

	value = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr3);
	value &= ~0x4;
	value |= mode << 2;
	flash_rtl_set_status(phal_spic_adaptor, cmd->wrsr3, value);
	DBG_SPIF_INFO("Status Register 3 = %x", flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr3));
}

/** \brief Description of flash_rtl_get_status
 *
 *    flash_rtl_get_status is used to send read status register command.
 *    Each flash may have more than one status registers that can be accessed with different instructions.
 *    Please refer to flash data sheet for more details
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u8 cmd:     The instruction of read status register command.
 *
 *   \return u8: the value of the status register.
 */
SECTION_FLASH_TEXT
u8 flash_rtl_get_status(void *adaptor, u8 cmd)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	u8 rd_data;

	/* disable spi_flash user mode */
	spic_rtl_disable(spic_dev);

