swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
	/* set ctrlr1; 1 byte data frames */
	spic_rtl_set_ctrl1(spic_dev, 1);

	/* send flash rx command and read the data */
	spic_rtl_rx_cmd(phal_spic_adaptor, cmd, 0, 0);

	/* set ctrlr1; 1 byte data frames */
	rd_data = HAL_READ8(SPIC_BASE, 0x60);

	return rd_data;
}

/** \brief Description of flash_rtl_get_status_with_addr
 *
 *    flash_rtl_get_status_with_addr is used to send read status register command.
 *    Each flash may have more than one status registers that can be accessed with different instructions.
 *    A address byte followed by the instruction is sent to identify which status register.
 *    Please refer to flash data sheet for more details
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u8 cmd:     The instruction of read status register command.
 *   \param u8 addr:    The address byte of read status register command.
 *
 *   \return u8: the value of the status register.
 */
SECTION_FLASH_TEXT
u8 flash_rtl_get_status_with_addr(void *adaptor, u8 cmd, u8 addr)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	u32 rd_data;

	/* disable spi_flash user mode */
	spic_rtl_disable(spic_dev);

	/* set ctrlr1; 1 byte data frames */
	spic_rtl_set_ctrl1(spic_dev, 1);

	/* send flash rx command and read the data */
	spic_rtl_rx_cmd(phal_spic_adaptor, cmd, 1, &addr);

	rd_data = HAL_READ8(SPIC_BASE, 0x60);

	return rd_data;
}

/** \brief Description of flash_rtl_get_extended_addr
 *
 *    flash_rtl_get_extended_addr is used to send read extended address register command.
 *    The value of the extended address register presents the fourth byte of the address phase.
 *    Some flashes cannot support this feature, please refer to flash data sheets.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return u8: the value of the extended addr register.
 */
SECTION_FLASH_TEXT
u8 flash_rtl_get_extended_addr(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	u32 rd_data;

	/* disable spi_flash user mode */
	spic_rtl_disable(spic_dev);

	/* set ctrlr1; 1 byte data frames */
	spic_rtl_set_ctrl1(spic_dev, 1);

	/* send flash rx command and read the data */
	spic_rtl_rx_cmd(phal_spic_adaptor, cmd->rear, 0, 0);

	rd_data = HAL_READ8(SPIC_BASE, 0x60);

	return rd_data;
}

/** \brief Description of flash_rtl_wait_ready
 *
 *    flash_rtl_wait_ready is used to check the BUSY/WIP bit of the status register.
 *    This function polls the BUSY/WIP of the status register until flash returns to ready state.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_wait_ready(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 flash_type = phal_spic_adaptor->flash_type;

	DBG_SPIF_INFO("flash_rtl_wait_ready: (0x%x)\n", adaptor);

	if (flash_type == FLASH_TYPE_MICRON) {
		do {
		} while (!(flash_rtl_get_status(adaptor, cmd->rdsr2) & 0x80));
	} else {
		do {
		} while (flash_rtl_get_status(adaptor, cmd->rdsr) & 0x1);
	}
}

/** \brief Description of flash_rtl_chip_erase
 *
 *    flash_rtl_chip_erase is used to send chip erase command.
 *    This function aims to erase whole flash chip.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_chip_erase(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->ce, 0, 0);
}

/** \brief Description of flash_rtl_64k_block_erase
 *
 *    flash_rtl_64k_block_erase is used to send 64K block erase command.
 *    This function aims to erase 64K byte blocks.
 *    The address is aligned to 64K byte boundaries.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 address:      The target address to be erased.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_64k_block_erase(void *adaptor, u32 address)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 addr[4];
	u8 addr_byte_num = phal_spic_adaptor->addr_byte_num;

	if (FourBytesLength == addr_byte_num) {
		addr[3] = address & 0xFF;
		addr[2] = (address >> 8) & 0xFF;
		addr[1] = (address >> 16) & 0xFF;
		addr[0] = (address >> 24) & 0xFF;
	} else {
		addr[2] = address & 0xFF;
		addr[1] = (address >> 8) & 0xFF;
		addr[0] = (address >> 16) & 0xFF;
	}

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->be_64k, addr_byte_num, addr);
}

/** \brief Description of flash_rtl_32k_block_erase
 *
 *    flash_rtl_32k_block_erase is used to send 32K block erase command.
 *    This function aims to erase 32K byte blocks.
 *    The address is aligned to 32K byte boundaries.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 address:      The target address to be erased.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_32k_block_erase(void *adaptor, u32 address)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 addr[4];
	u8 addr_byte_num = phal_spic_adaptor->addr_byte_num;

	if (FourBytesLength == addr_byte_num) {
		addr[3] = address & 0xFF;
		addr[2] = (address >> 8) & 0xFF;
		addr[1] = (address >> 16) & 0xFF;
		addr[0] = (address >> 24) & 0xFF;
	} else {
		addr[2] = address & 0xFF;
		addr[1] = (address >> 8) & 0xFF;
		addr[0] = (address >> 16) & 0xFF;
	}

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->be_32k, addr_byte_num, addr);
}

/** \brief Description of flash_rtl_sector_erase
 *
 *    flash_rtl_sector_erase is used to send sector erase command.
 *    This function aims to erase 4K byte sectors.
 *    The address is aligned to 4K byte boundaries.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 address:      The target address to be erased.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_sector_erase(void *adaptor, u32 address)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 addr[4];
	u8 addr_byte_num = phal_spic_adaptor->addr_byte_num;

