swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
	if (FourBytesLength == addr_byte_num) {
		addr[3] = address & 0xFF;
		addr[2] = (address >> 8) & 0xFF;
		addr[1] = (address >> 16) & 0xFF;
		addr[0] = (address >> 24) & 0xFF;
	} else {
		addr[2] = address & 0xFF;
		addr[1] = (address >> 8) & 0xFF;
		addr[0] = (address >> 16) & 0xFF;
	}

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->se, addr_byte_num, addr);
}

/** \brief Description of flash_rtl_query_sector_protect_state
 *
 *    flash_rtl_query_sector_protect_state is used to query the sector's write protect status.
 *    This function is only valid for flashes supporting individual block protect or sector protect feature.
 *    Please refer to flash data sheets for more details.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 address:      The target address to query write protect state.
 *
 *   \return u8: the write protect status.
 */
SECTION_FLASH_TEXT
u8 flash_rtl_query_sector_protect_state(void *adaptor, u32 address)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	SPIC_TypeDef *spic_dev = phal_spic_adaptor->spic_dev;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 addr[4];
	u8 addr_byte_num = phal_spic_adaptor->addr_byte_num;
	u8 rd_data = 0;

	if (FourBytesLength == addr_byte_num) {
		addr[3] = address & 0xFF;
		addr[2] = (address >> 8) & 0xFF;
		addr[1] = (address >> 16) & 0xFF;
		addr[0] = (address >> 24) & 0xFF;
		addr_byte_num = 4;
	} else {
		addr[2] = address & 0xFF;
		addr[1] = (address >> 8) & 0xFF;
		addr[0] = (address >> 16) & 0xFF;
	}

	spic_rtl_disable(spic_dev);

	/* set ctrlr1; 1 byte data frames */
	spic_rtl_set_ctrl1(spic_dev, 1);

	/* send flash rx command and read the data */
	spic_rtl_rx_cmd(phal_spic_adaptor, cmd->rd_block_lock, addr_byte_num, addr);

	/* set ctrlr1; 1 byte data frames */
	rd_data = HAL_READ8(SPIC_BASE, 0x60);

	return rd_data;
}

/** \brief Description of flash_rtl_protect_sector
 *
 *    flash_rtl_protect_sector is used to send individual write protect command.
 *    This function is only valid for flashes supporting individual block protect or sector protect feature.
 *    For actual protect regions depending on flash types.
 *    Please refer to flash data sheets for more details.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 address:      The target address to enable write protect.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_protect_sector(void *adaptor, u32 address)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 addr[4];
	u8 addr_byte_num = phal_spic_adaptor->addr_byte_num;

	if (FourBytesLength == addr_byte_num) {
		addr[3] = address & 0xFF;
		addr[2] = (address >> 8) & 0xFF;
		addr[1] = (address >> 16) & 0xFF;
		addr[0] = (address >> 24) & 0xFF;
	} else {
		addr[2] = address & 0xFF;
		addr[1] = (address >> 8) & 0xFF;
		addr[0] = (address >> 16) & 0xFF;
	}

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->block_lock, addr_byte_num, addr);

}

/** \brief Description of flash_rtl_unprotect_sector
 *
 *    flash_rtl_unprotect_sector is used to send individual write unprotect command.
 *    This function is only valid for flashes supporting individual block protect or sector protect feature.
 *    For actual protect regions depending on flash types.
 *    Please refer to flash data sheets for more details.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 address:      The target address to disable write protect.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_unprotect_sector(void *adaptor, u32 address)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 addr[4];
	u8 addr_byte_num = phal_spic_adaptor->addr_byte_num;

	if (FourBytesLength == addr_byte_num) {
		addr[3] = address & 0xFF;
		addr[2] = (address >> 8) & 0xFF;
		addr[1] = (address >> 16) & 0xFF;
		addr[0] = (address >> 24) & 0xFF;
	} else {
		addr[2] = address & 0xFF;
		addr[1] = (address >> 8) & 0xFF;
		addr[0] = (address >> 16) & 0xFF;
	}

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->block_unlock, addr_byte_num, addr);

}

/** \brief Description of flash_rtl_global_lock
 *
 *    flash_rtl_global_lock is used to send whole chip write protect command.
 *    This function is only valid some of Winbond flash.
 *    Please refer to flash data sheets for more details.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_global_lock(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->global_lock, 0, 0);
}

/** \brief Description of flash_rtl_global_unlock
 *
 *    flash_rtl_global_unlock is used to send whole chip write unprotect command.
 *    This function is only valid some of Winbond flash.
 *    Please refer to flash data sheets for more details.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_global_unlock(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;

	flash_rtl_set_write_enable(phal_spic_adaptor);
	spic_rtl_tx_cmd(phal_spic_adaptor, cmd->global_unlock, 0, 0);
}

/** \brief Description of flash_rtl_set_dummy_cycle
 *
 *    flash_rtl_set_dummy_cycle is used to configure flash dummy cycle.
 *    Flash allows users to adjust dummy cycles with various operting frequency under multiple IO modes.
 *    Higher speed requires more dummy cycles.
 *    We take into account the SPIC clock source and performance to derive optimal operating frequnecy of flash.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_dummy_cycle(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	u8 dummy_para = 0;
	u8 spic_bit_mode = phal_spic_adaptor->spic_bit_mode;
	u8 flash_type = phal_spic_adaptor->flash_type;

