swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
	if (FLASH_TYPE_WINBOND == flash_type) {
		if ((spic_bit_mode == SpicQpiMode) || (spic_bit_mode == SpicQpiDtrMode)) {
			dummy_para = 0x20;
			spic_rtl_tx_cmd_no_check(phal_spic_adaptor, 0xC0, 1, &dummy_para);
		}
	}
}

/** \brief Description of flash_rtl_set_quad_enable
 *
 *    flash_rtl_set_quad_enable is used to set quad enable bit of flash.
 *    Some flash types require flash to set quad enable bit before switching to Quad IO mode.
 *    Only Winbond and MXIC supports this function.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_set_quad_enable(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 flash_type = phal_spic_adaptor->flash_type;
	u8 status_value = 0;

	u8 data[2];

	switch (flash_type) {
	case FLASH_TYPE_WINBOND:
	case FLASH_TYPE_GD32:
	case FLASH_TYPE_BOYA:
	case FLASH_TYPE_XMC:
	case FLASH_TYPE_ZBIT:
		status_value = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr2);
		flash_rtl_set_status(phal_spic_adaptor, cmd->wrsr2, 0x2 | status_value);
		break;

	case FLASH_TYPE_MXIC:
		status_value = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr);
		flash_rtl_set_status(phal_spic_adaptor, cmd->wrsr, 0x40 | status_value);
		break;

	case FLASH_TYPE_GD:
	case FLASH_TYPE_XTX:
		data[0] = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr);
		data[1] = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr2) | 0x2;
		flash_rtl_set_write_enable(phal_spic_adaptor);
		spic_rtl_tx_cmd(phal_spic_adaptor, cmd->wrsr, 2, data);
		break;

	case FLASH_TYPE_EON:
		break;

	default:
		DBG_SPIF_ERR("Unknown flash type, cannot set QE bit!\n");
	}
}

/** \brief Description of flash_rtl_unset_quad_enable
 *
 *    flash_rtl_unset_quad_enable is used to clear quad enable bit of flash.
 *    Quad IO bit should be cleaned before switching to other non-Quad IO mode.
 *    Only Winbond and MXIC supports this function.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_unset_quad_enable(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 flash_type = phal_spic_adaptor->flash_type;
	u8 status_value = 0;
	u8 data[2];

	switch (flash_type) {
	case FLASH_TYPE_WINBOND:
	case FLASH_TYPE_GD32:
	case FLASH_TYPE_BOYA:
	case FLASH_TYPE_XMC:
	case FLASH_TYPE_ZBIT:
		status_value = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr2);
		flash_rtl_set_status(phal_spic_adaptor, cmd->wrsr2, ~0x2 & status_value);
		break;

	case FLASH_TYPE_MXIC:
		status_value = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr);
		flash_rtl_set_status(phal_spic_adaptor, cmd->wrsr, ~0x40 & status_value);
		break;

	case FLASH_TYPE_GD:
	case FLASH_TYPE_XTX:
		data[0] = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr);
		data[1] = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr2) & (~0x2);
		flash_rtl_set_write_enable(phal_spic_adaptor);
		spic_rtl_tx_cmd(phal_spic_adaptor, cmd->wrsr, 2, data);
		break;

	case FLASH_TYPE_EON:
	case FLASH_TYPE_MICRON:
		break;

	default:
		DBG_SPIF_ERR("Unknown flash type, cannot reset QE bit!\n");
	}
}

/** \brief Description of flash_rtl_enable_qpi
 *
 *    flash_rtl_enable_qpi is used to switch flash to QPI mode (4-4-4).
 *    Quad enable bit is set before SPIC sends enter QPI mode command.
 *    Only Adesto, Winbond and MXIC supports this function.
 *    Must ensure flash is under SPI mode before CPU enters this function.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_enable_qpi(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u8 flash_type = phal_spic_adaptor->flash_type;
	u8 status_value = 0;

	phal_spic_adaptor->spic_send_cmd_mode = SingleChnl;

	switch (flash_type) {
	case FLASH_TYPE_WINBOND:
		status_value = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr2);
		flash_rtl_set_status(phal_spic_adaptor, cmd->wrsr2, 0x2 | status_value);
		spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->en_qpi, 0, 0);
		/*if QPI works, change with check*/
		break;

	case FLASH_TYPE_MXIC:
		status_value = flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr);
		flash_rtl_set_status(phal_spic_adaptor, cmd->wrsr, 0x40 | status_value);
		spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->en_qpi, 0, 0);
		/*if QPI works, change with check*/
		break;

	case FLASH_TYPE_EON:
		spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->en_qpi, 0, 0);

	case FLASH_TYPE_MICRON:
		break;

	default:
		DBG_SPIF_ERR("Unknown flash type, cannot switch to QPI mode!\n");
	}

	phal_spic_adaptor->spic_send_cmd_mode = QuadChnl;
	phal_spic_adaptor->cmd_chnl = QuadChnl;
	phal_spic_adaptor->addr_chnl = QuadChnl;
	phal_spic_adaptor->data_chnl = QuadChnl;
	spic_rtl_set_chnl_num(phal_spic_adaptor);
	flash_rtl_set_dummy_cycle(phal_spic_adaptor);
}

/** \brief Description of flash_rtl_return_spi
 *
 *    flash_rtl_return_spi is used to switch flash back to SPI mode.
 *    Unlike flash_reset_to_spi function recovering flash back to SPI mode from abnormal state,
 *    this funciton is a bridge to switch between different IO mode when flash is under control.
 *    Every IO mode should call this function to switch back to SPI mode before flash enters the other IO mode.
 *    Only Adesto, Winbond and MXIC support this function.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_return_spi(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u32 reg_value;
	spic_init_para_t spic_init_data;
	pspic_init_para_t pspic_init_data = &spic_init_data;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	u8 spic_send_cmd_mode = phal_spic_adaptor->spic_send_cmd_mode;
	u8 spic_bit_mode = phal_spic_adaptor->spic_bit_mode;
	u8 cpu_type = spic_rtl_query_system_clk();

	if (phal_spic_adaptor->spic_init_data[SpicOneIOMode][cpu_type].valid) {
		pspic_init_data = &(phal_spic_adaptor->spic_init_data[SpicOneIOMode][cpu_type]);
	} else {
		spic_rtl_load_default_setting(pspic_init_data);
	}

