swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
	/*Disable SPIC to set control register*/
	spic_rtl_disable(spic_dev);

	/*Send cmd to switch from QPI to SPI mode, if QPI works, change with check for non-adesto*/
	if (spic_send_cmd_mode == QuadChnl) {
		spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->en_spi, 0, 0);
	}

	phal_spic_adaptor->spic_send_cmd_mode = SingleChnl;
	phal_spic_adaptor->cmd_chnl = SingleChnl;
	phal_spic_adaptor->addr_chnl = SingleChnl;
	phal_spic_adaptor->data_chnl = SingleChnl;
	spic_rtl_set_chnl_num(phal_spic_adaptor);
	flash_rtl_return_str(phal_spic_adaptor);
	flash_rtl_wait_ready(phal_spic_adaptor);

	if ((spic_bit_mode == SpicQuadIOMode)
		|| (spic_bit_mode == SpicQuadIODtrMode)
		|| (spic_bit_mode == SpicQpiMode)
		|| (spic_bit_mode == SpicQpiDtrMode)) {
		flash_rtl_unset_quad_enable(phal_spic_adaptor);
	}

	/*Restore back to one IO auto mode*/
	spic_dev->SPIC_VALID_CMD = SPIC_BIT_WR_BLOCKING;

	/*Resotre back to one IO user mode*/
	phal_spic_adaptor->spic_bit_mode = SpicOneIOMode;
	phal_spic_adaptor->read_cmd = cmd->read;
	phal_spic_adaptor->addr_byte_num = ThreeBytesLength;
	reg_value = spic_dev->SPIC_AUTO_LENGTH;
	reg_value &= ~SPIC_MASK_AUTO_ADDR_LENGTH;
	reg_value |= (phal_spic_adaptor->addr_byte_num << SPIC_SHIFT_AUTO_ADDR_LENGTH);
	spic_dev->SPIC_AUTO_LENGTH = reg_value;
	spic_dev->SPIC_ADDR_LENGTH = phal_spic_adaptor->addr_byte_num;

	spic_rtl_set_dummy_cycle(spic_dev, pspic_init_data->rd_dummy_cycle);
	spic_rtl_set_baudr(spic_dev, pspic_init_data->baud_rate);
	spic_rtl_set_delay_line(pspic_init_data->delay_line);
}

/** \brief Description of flash_rtl_return_str
 *
 *    flash_rtl_return_str is used to set SPIC, not flash, to STR mode
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_return_str(void *adaptor)
{
	SYSON_S_TypeDef *syson_s = SYSON_S;
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	u32 reg_ctrl_value;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;

	phal_spic_adaptor->dtr_en = DISABLE;
	reg_ctrl_value = spic_dev->SPIC_CTRLR0;
	reg_ctrl_value &= ~(SPIC_BIT_CMD_DDR_EN | SPIC_BIT_DATA_DDR_EN | SPIC_BIT_ADDR_DDR_EN);
	spic_dev->SPIC_CTRLR0 = reg_ctrl_value;

	/*Disable DTR PHY*/
	//syson->hs_flash_phy_ctrl0_b.hs_flash_phy_dqs_ddr_en = DISABLE;
	syson_s->SYSON_S_REG_SYS_FLASH_PHY_CTRL0 &= ~SYSON_S_BIT_FLASH_PHY_DQS_DDR_EN;
}

/** \brief Description of flash_rtl_enter_power_down
 *
 *    flash_rtl_enter_power_down is used to send deep power down command.
 *    Flash enters deep power down state after this function.
 *    Any access except few commands is ignored by flash.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return hal_status_t.
 */
SECTION_FLASH_TEXT
hal_status_t flash_rtl_enter_power_down(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;

	flash_rtl_wait_ready(phal_spic_adaptor);
	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->dp, 0, 0);

	rtl_dcache_invalidate_by_addr((uint32_t *) SPI_FLASH_BASE, 32);
	if (HAL_READ32(SPI_FLASH_BASE, 0x0) == spic_calibration_pattern[0]) {
		DBG_SPIF_ERR("Flash fails to enter power down mode\n");
		return HAL_ERR_HW;
	}

	DBG_SPIF_WARN("Flash enters power down mode\n");
	return HAL_OK;
}

/** \brief Description of flash_rtl_release_from_power_down
 *
 *    flash_rtl_release_from_power_down is used to send release from deep power down command.
 *    Flash returns from deep power down state after this function.
 *    It can accept any command normally.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *
 *   \return hal_status_t.
 */
SECTION_FLASH_TEXT
hal_status_t flash_rtl_release_from_power_down(void *adaptor)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	pflash_cmd_t cmd = (pflash_cmd_t)&default_cmd;

	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->rdp, 0, 0);
	hal_delay_us(100);

	spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->wren, 0, 0);
	if (flash_rtl_get_status(phal_spic_adaptor, cmd->rdsr) & 0x2) {
		spic_rtl_tx_cmd_no_check(phal_spic_adaptor, cmd->wrdi, 0, 0);
	} else {
		DBG_SPIF_WARN("Flash may fail to release from power down mode\n");
		return HAL_ERR_HW;
	}

	DBG_SPIF_WARN("Flash releases from power down mode\n");
	return HAL_OK;
}

/** \brief Description of flash_rtl_stream_read
 *
 *    flash_rtl_stream_read is used to read sequential data with auto mode.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 length:      The transfer length.
 *   \param u32 addr:      The starting read address in flash.
 *   \param u8 *data:      The destination address in memory to store data.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_stream_read(void *adaptor, u32 length, u32 addr, u8 *data)
{
	u32 rd_data;
	u32 *tmp;
	u8 *ptr;

	tmp = (u32 *)data;
	while (length >= 4) {
		*tmp = HAL_READ32(SPI_FLASH_BASE, addr);
		addr += 4;
		tmp++;
		length -= 4;
	}

	data = (u8 *)tmp;
	if (length > 0) {
		rd_data = HAL_READ32(SPI_FLASH_BASE, addr);
		ptr = (u8 *)&rd_data;
		while (length > 0) {
			*data = *ptr;
			ptr++;
			data++;
			length--;
		}
	}
}

/** \brief Description of flash_rtl_stream_write
 *
 *    flash_rtl_stream_write is used to program sequential data with auto mode.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 length:      The transfer length.
 *   \param u32 addr:      The starting program address in flash.
 *   \param u8 *data:      The address of data. Data stored in ram is about to be programmed to the flash.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_stream_write(void *adaptor, u32 length, u32 addr, u8 *data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	u8 offset_to_align;
	u32 i;
	u32 align_addr;
	u32 write_word = 0;
	uint8_t *ptr;

	offset_to_align = addr & 0x3;
	if (offset_to_align) {
		align_addr = addr - offset_to_align;
		write_word = HAL_READ32(SPI_FLASH_BASE, align_addr);
		ptr = (uint8_t *)&write_word + offset_to_align;

		for (i = 0; i < (4 - offset_to_align); i++) {
			*(ptr + i) = *(data + i);
			length--;
			if (length == 0) {
				break;
			}
		}

		data += (4 - offset_to_align);
		HAL_WRITE32(SPI_FLASH_BASE, align_addr, write_word);
		rtl_dcache_invalidate_by_addr((uint32_t *) SPI_FLASH_BASE + align_addr, 4);
		flash_rtl_wait_ready(phal_spic_adaptor);
	}

	addr = (((addr - 1) >> 2) + 1) << 2;

	if (((u32)data) & 0x3) {
		while (length >= 4) {
			write_word  = ((u32)(*data)) | ((u32)(*(data + 1)) << 8) | ((u32)(*(data + 2)) << 16) | ((u32)(*(data + 3)) << 24);
			HAL_WRITE32(SPI_FLASH_BASE, addr, write_word);
			rtl_dcache_invalidate_by_addr((uint32_t *) SPI_FLASH_BASE + addr, 4);
			flash_rtl_wait_ready(phal_spic_adaptor);
			data += 4;
			addr += 4;
			length -= 4;
		}
	} else {
		while (length >= 4) {
			HAL_WRITE32(SPI_FLASH_BASE, addr, (u32) * ((u32 *)data));
			rtl_dcache_invalidate_by_addr((uint32_t *) SPI_FLASH_BASE + addr, 4);
			flash_rtl_wait_ready(phal_spic_adaptor);
			data += 4;
			addr += 4;
			length -= 4;
		}
	}

	if (length > 0) {
		ptr = (uint8_t *)&write_word;
		for (i = 0; i < length; i++) {
			*(ptr + i) = *(data + i);
		}

		HAL_WRITE32(SPI_FLASH_BASE, addr, write_word);
		rtl_dcache_invalidate_by_addr((uint32_t *) SPI_FLASH_BASE + addr, 4);
		flash_rtl_wait_ready(phal_spic_adaptor);
	}

