swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
}

/** \brief Description of flash_rtl_burst_read
 *
 *    flash_rtl_burst_read is used to read sequential data with user mode.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 length:      The transfer length.
 *   \param u32 addr:      The starting read address in flash.
 *   \param u8 *data:      The destination address in memory to store data.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_burst_read(void *adaptor, u32 length, u32 addr, u8 *data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	u32 rd_data;
	u32 tmp;
	u32 transfer_byte = 0;
	u32 reg_value = 0;
	u8 addr_byte[4];
	u8 *ptr;
	u8 *buf;
	u8 i;
	u8 addr_byte_num;
	u8 ndf_limit = 64;
	u8 read_cmd = phal_spic_adaptor->read_cmd;
	u8 spic_bit_mode = phal_spic_adaptor->spic_bit_mode;
	u32 *temp;

	buf = data;
	temp = (u32 *) buf;
	ptr = (u8 *) &rd_data;
	addr_byte_num = phal_spic_adaptor->addr_byte_num;

	spic_rtl_disable(spic_dev);

	spic_dev->SPIC_VALID_CMD &= ~SPIC_BIT_PRM_EN;

	/* Set rx mode */
	reg_value = spic_dev->SPIC_CTRLR0;
	reg_value &= ~SPIC_MASK_TMOD;
	reg_value |= (RxMode << SPIC_SHIFT_TMOD);
	spic_dev->SPIC_CTRLR0 = reg_value;

	/* Set length of address byte */
	spic_dev->SPIC_ADDR_LENGTH = addr_byte_num;

	spic_rtl_set_chnl_num(phal_spic_adaptor);

	addr_byte[3] = (addr & 0xFF000000) >> 24;
	addr_byte[2] = (addr & 0xFF0000) >> 16;
	addr_byte[1] = (addr & 0xFF00) >> 8;
	addr_byte[0] = addr & 0xFF;

	if (addr_byte_num == 3) {
		tmp = read_cmd | (addr_byte[2] << 8) | (addr_byte[1] << 16) | (addr_byte[0] << 24);
		spic_dev->SPIC_DR_WORD = tmp;

		if ((SpicQuadIOMode == spic_bit_mode)
			|| (SpicQpiMode == spic_bit_mode)
			|| (SpicQuadIODtrMode == spic_bit_mode)
			|| (SpicQpiDtrMode == spic_bit_mode)) {
			spic_dev->SPIC_ADDR_LENGTH = 0;
			HAL_WRITE8(SPIC_BASE, 0x60, 0);
		}
	} else {
		HAL_WRITE8(SPIC_BASE, 0x60, read_cmd);
		tmp = addr_byte[3] | (addr_byte[2] << 8) | (addr_byte[1] << 16) | (addr_byte[0] << 24);
		spic_dev->SPIC_DR_WORD = tmp;

		if ((SpicQuadIOMode == spic_bit_mode)
			|| (SpicQpiMode == spic_bit_mode)
			|| (SpicQuadIODtrMode == spic_bit_mode)
			|| (SpicQpiDtrMode == spic_bit_mode)) {
			spic_dev->SPIC_ADDR_LENGTH = 4;
			HAL_WRITE8(SPIC_BASE, 0x60, 0);
		}
	}


	if (length <= ndf_limit) {
		spic_rtl_set_ctrl1(spic_dev, length);
	} else {
		spic_rtl_set_ctrl1(spic_dev, ndf_limit);
	}

	/* Enable SPI_FLASH  User Mode to receive data*/
	spic_rtl_enable(spic_dev);

	spic_rtl_wait_ready(spic_dev);

	while (length > 0) {
		if (transfer_byte >= ndf_limit) {

			addr += ndf_limit;
			transfer_byte = 0;
			addr_byte[3] = (addr & 0xFF000000) >> 24;
			addr_byte[2] = (addr & 0xFF0000) >> 16;
			addr_byte[1] = (addr & 0xFF00) >> 8;
			addr_byte[0] = addr & 0xFF;

			spic_rtl_disable(spic_dev);

			if (addr_byte_num == 3) {
				tmp = read_cmd | (addr_byte[2] << 8) | (addr_byte[1] << 16) | (addr_byte[0] << 24);
				spic_dev->SPIC_DR_WORD = tmp;
			} else {
				HAL_WRITE8(SPIC_BASE, 0x60, read_cmd);
				tmp = addr_byte[3] | (addr_byte[2] << 8) | (addr_byte[1] << 16) | (addr_byte[0] << 24);
				spic_dev->SPIC_DR_WORD = tmp;
			}

			if ((SpicQuadIOMode == spic_bit_mode)
				|| (SpicQpiMode == spic_bit_mode)
				|| (SpicQuadIODtrMode == spic_bit_mode)
				|| (SpicQpiDtrMode == spic_bit_mode)) {
				HAL_WRITE8(SPIC_BASE, 0x60, 0);
			}

			if (length <= ndf_limit) {
				spic_rtl_set_ctrl1(spic_dev, length);
			} else {
				spic_rtl_set_ctrl1(spic_dev, ndf_limit);
			}

			spic_rtl_enable(spic_dev);
			spic_rtl_wait_ready(spic_dev);
		}

		rd_data = spic_dev->SPIC_DR_WORD;
		if (length >= 4) {
			temp = (u32 *) buf;
			*temp = rd_data;
			temp++;
			buf += 4;
			length -= 4;
			transfer_byte += 4;

		} else {
			buf = (u8 *) temp;

			for (i = 0; i < length; i++) {
				*buf = *(ptr + i);
				buf++;
			}

			length = 0;
		}
	}

	/* disable spi_flash user mode */
	spic_rtl_disable(spic_dev);

	spic_dev->SPIC_VALID_CMD |= SPIC_BIT_PRM_EN;

	/* flush fifo */
	spic_rtl_flush_fifo(spic_dev);
}

/** \brief Description of flash_rtl_burst_write
 *
 *    flash_rtl_burst_write is used to program sequential data with user mode.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 length:      The transfer length.
 *   \param u32 addr:      The starting program address in flash.
 *   \param u8 *data:      The address of data. Data stored in ram is about to be programmed to the flash.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_burst_write(void *adaptor, u32 length, u32 addr, u8 *data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	u32 existed_data_size;
	u32 program_size;
	u32 page_size;

	page_size = 256;
	existed_data_size = addr & 0xFF;

	if ((length >= page_size)
		|| ((length + existed_data_size) >= page_size)) {
		program_size = page_size - existed_data_size;
	} else {
		program_size = length;
	}

	while (length > 0) {
		if (existed_data_size) {
			flash_rtl_page_program(phal_spic_adaptor, program_size, addr, data);
			addr += program_size;
			data += program_size;
			length -= program_size;
			existed_data_size = 0;
		} else {
			while (length >= page_size) {
				flash_rtl_page_program(phal_spic_adaptor, page_size, addr, data);
				addr += page_size;
				data += page_size;
				length -= page_size;
			}

			if (length > 0) {
				flash_rtl_page_program(phal_spic_adaptor, length, addr, data);
				break;
			}
		}
	}
}

/** \brief Description of flash_rtl_page_program
 *
 *    flash_rtl_page_program is used to divide total transfer length into several pages.
 *    Each page program command can program 256 bytes, a page size, at most.
 *    Multiple program commands should be sent if the transfer length is larger than the page size.
 *    Please refer to flash data sheets about page program command for more details.
 *
 *   \param void *adaptor:      The pointer of the flash adaptor.
 *   \param u32 length:      The transfer length.
 *   \param u32 addr:      The starting program address in flash.
 *   \param u8 *data:      The address of data. Data stored in ram is about to be programmed to the flash.
 *
 *   \return void.
 */
SECTION_FLASH_TEXT
void flash_rtl_page_program(void *adaptor, u32 length, u32 addr, u8 *data)
{
	phal_spic_adaptor_t phal_spic_adaptor = (phal_spic_adaptor_t) adaptor;
	SPIC_TypeDef *spic_dev  = phal_spic_adaptor->spic_dev;
	pflash_cmd_t cmd = phal_spic_adaptor->cmd;
	u32 reg_ctrl_value;
	u32 occu_size;
	u32 program_length;
	u32 page_size;
	u32 tmp;
	u8 addr_byte[4];
	u8 spic_send_cmd_mode;
	u8 cmd_ddr_en;
	u8 addr_ddr_en;
	u8 data_ddr_en;
	u8 addr_byte_num;
	u8 buffer[256];
	u8 *ptr = &buffer[0];
	u8 nop_index = 0;
	u8 nop_delay = 160;

	page_size = 256;
	occu_size = addr & 0xFF;

	if (phal_spic_adaptor->write_delay != 0) {
		nop_delay = phal_spic_adaptor->write_delay;
	}

