swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash.c
	if (((u32)data >> 24) == 0x8) {
		flash_rtl_stream_read(phal_spic_adaptor, length, (u32)data, buffer);
	}

	addr_byte_num = phal_spic_adaptor->addr_byte_num;
	spic_send_cmd_mode = phal_spic_adaptor->spic_send_cmd_mode;
	program_length = 0;

	/*Load ctrlr0 value to configure*/
	reg_ctrl_value = spic_dev->SPIC_CTRLR0;

	if (phal_spic_adaptor->dtr_en) {
		/*Save current ddr state*/
		cmd_ddr_en = (reg_ctrl_value & SPIC_BIT_CMD_DDR_EN) >> SPIC_SHIFT_CMD_DDR_EN;
		addr_ddr_en = (reg_ctrl_value & SPIC_BIT_ADDR_DDR_EN) >> SPIC_SHIFT_ADDR_DDR_EN;
		data_ddr_en = (reg_ctrl_value & SPIC_BIT_DATA_DDR_EN) >> SPIC_SHIFT_DATA_DDR_EN;

		/*Should program under STR mode*/
		reg_ctrl_value &= ~(SPIC_BIT_CMD_DDR_EN | SPIC_BIT_ADDR_DDR_EN | SPIC_BIT_DATA_DDR_EN);
	}

	if (occu_size) {
		if ((length >= page_size)
			|| ((occu_size + length) >= page_size)) {
			program_length = page_size - occu_size;
		} else {
			program_length = length;
		}
	} else {//program from the beginning of the page
		if (length >= page_size) {
			program_length = page_size;
		} else {
			program_length = length;
		}
	}

	/* Set writen enable bit */
	flash_rtl_set_write_enable(phal_spic_adaptor);

	/* Disable spic in user mode */
	spic_rtl_disable(spic_dev);

	spic_dev->SPIC_VALID_CMD &= ~SPIC_BIT_PRM_EN;

	addr_byte[3] = (addr & 0xFF000000) >> 24;
	addr_byte[2] = (addr & 0xFF0000) >> 16;
	addr_byte[1] = (addr & 0xFF00) >> 8;
	addr_byte[0] = addr & 0xFF;

	if (addr_byte_num == 3) {
		tmp = (cmd->pp) | (addr_byte[2] << 8) | (addr_byte[1] << 16) | (addr_byte[0] << 24);
		spic_dev->SPIC_DR_WORD = tmp;
	} else {
		HAL_WRITE8(SPIC_BASE, 0x60, cmd->pp);
		tmp = addr_byte[3] | (addr_byte[2] << 8) | (addr_byte[1] << 16) | (addr_byte[0] << 24);
		spic_dev->SPIC_DR_WORD = tmp;
	}

	/* Set tx mode*/
	reg_ctrl_value &= ~SPIC_MASK_TMOD;
	reg_ctrl_value |= (TxMode << SPIC_SHIFT_TMOD);

	/* Set length of address byte */
	spic_dev->SPIC_ADDR_LENGTH = addr_byte_num;

	/*Program can be executed only with 1-1-1, 4-4-4, 8-8-8 mode*/
	switch (spic_send_cmd_mode) {
	case SingleChnl:
		reg_ctrl_value &= ~(SPIC_MASK_ADDR_CH | SPIC_MASK_DATA_CH | SPIC_MASK_CMD_CH);
		reg_ctrl_value |= ((SingleChnl << SPIC_SHIFT_CMD_CH) | (SingleChnl << SPIC_SHIFT_DATA_CH) | (SingleChnl << SPIC_SHIFT_ADDR_CH));
		break;

	case QuadChnl:
		reg_ctrl_value &= ~(SPIC_MASK_ADDR_CH | SPIC_MASK_DATA_CH | SPIC_MASK_CMD_CH);
		reg_ctrl_value |= ((QuadChnl << SPIC_SHIFT_CMD_CH) | (QuadChnl << SPIC_SHIFT_DATA_CH) | (QuadChnl << SPIC_SHIFT_ADDR_CH));
		break;

	default:
		DBG_SPIF_ERR("Wrong IO Mode to program!\n");
	}

	spic_dev->SPIC_CTRLR0 = reg_ctrl_value;

	/*Set Ctrl2 to enable data split program*/
	spic_dev->SPIC_CTRLR2 |= SPIC_BIT_SEQ_EN;

	if (((u32)data >> 24) == 0x8) {
		data = ptr;
	}

	/* Enable spic in user mode */
	spic_rtl_enable(spic_dev);

	while (program_length >= 4) {
		spic_dev->SPIC_DR_WORD = (u32) * ((u32 *)data);
		program_length -= 4;
		data += 4;

		if (program_length != 0) {
			for (nop_index = 0; nop_index < nop_delay; nop_index++) {
				__NOP();
			}
		}
	}

	while (program_length > 0) {
		HAL_WRITE8(SPIC_BASE, 0x60, (u8)(*data));
		program_length--;
		data++;
	}

	/*Poll SPIC to get ready*/
	spic_rtl_wait_ready(spic_dev);

	/*Poll Flash to get ready*/
	flash_rtl_wait_ready(phal_spic_adaptor);

	/*Disable spic in user mode*/
	spic_rtl_disable(spic_dev);

	spic_dev->SPIC_CTRLR2 &= ~SPIC_BIT_SEQ_EN;

	spic_dev->SPIC_VALID_CMD |= SPIC_BIT_PRM_EN;

	/* Recover ddr state*/
	if (phal_spic_adaptor->dtr_en) {
		reg_ctrl_value = spic_dev->SPIC_CTRLR0;
		reg_ctrl_value |= (cmd_ddr_en << SPIC_SHIFT_CMD_DDR_EN) | (addr_ddr_en << SPIC_SHIFT_ADDR_DDR_EN) | (data_ddr_en << SPIC_SHIFT_DATA_DDR_EN);
		spic_dev->SPIC_CTRLR0 = reg_ctrl_value;
	}
}

/** *@} */ /* End of group hal_flash_rtl_func */

/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** *@} */

